#!/bin/bash
# установка основных программ
#echo 'https://github.com/dimishpatriot/bash_scripts'
echo '============================================================================='
echo '=============   Начальный конфигуратор Linux Mint версия 1.0   =============='
echo '============================================================================='
echo 'Выберите желаемое действие:'
echo '1. Системные утилиты'
echo '2. Программы для Интернета'
echo '3. Программы для общения'
echo '4. Программы разработчика'
echo '5. Программы для работы с мультимедиа'
echo '6. Индикаторы системы'
echo '7. Прочие'
echo '8. Установить полностью'
echo '0. Выход'

# обработка ввода
read -n 1 -p '#: ' ans
echo ''
# проверка 0
if [ ${ans} -eq 0 ]; then exit; fi

echo '============================================================================='
echo '=========================   Обновление системы   ============================'
echo '============================================================================='
sudo apt-get full-upgrade -y

# выбор пунктов меню
case "$ans" in
1) ./1_sys_utils.sh;;
2) ./2_internet_prog.sh;;
3) ./3_talk_prog.sh;;
4) ./4_prog_tools.sh;;
5) ./5_media_prog.sh;;
6) ./6_sys_ind.sh;;
7) ./7_other.sh;;
8)  ./1_sys_utils.sh
    ./2_internet_prog.sh
    ./3_talk_prog.sh
    ./4_prog_tools.sh
    ./5_media_prog.sh
    ./6_sys_ind.sh
    ./7_other.sh;;
esac

echo '============================================================================='
echo '=============================   Обновление   ================================'
echo '============================================================================='
sudo apt-get upgrade

echo '============================================================================='
echo '=====================   Восстановление зависимостей   ======================='
echo '============================================================================='
sudo apt install -y -f

echo '============================================================================='
echo '===============   Удаление лишних пакетов, чистка кеша APT   ================'
echo '============================================================================='
sudo apt autoremove -y
sudo apt-get autoclean -y
